app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "pins"
---
  def index
    @pins = Pin.all.order('created_at DESC').paginate(:page => params[:page], :per_page => 4)

INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-11 21:48:36.935193"], ["description", "pins show the user"], ["updated_at", "2015-05-11 21:48:36.935193"], ["user_id", 1]]
---
  def create
    @pin = current_user.pins.build(pin_params)
    @pin.save

UPDATE "pins" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = 10  [["image_file_name", "tumblr_mxpd74jpT61qa4p8ho1_500.jpg"], ["image_file_size", 22911], ["image_updated_at", "2015-05-13 00:37:08.356572"], ["updated_at", "2015-05-13 00:37:12.466807"]]
---
  def update
    @pin.update(pin_params)